Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes Properties
The PlacingAttributes type exposes the following members.
Properties
Name | Description
IsFixed
 Defines whether the object is using fixed or free placing. If set to true, it means that fixed placing is enabled, and the object will not be rearranged in the drawing automatically. If set to false, then free placing is enabled, and the object will be placed in the most appropriate location near the original location.
PlacingDistance
 Gets or sets the placing distance attributes.
PlacingQuarter
 Gets or sets the placing quarter attributes.
Top
See Also
Reference
PlacingAttributes Class
Tekla.Structures.Drawing Namespace